app/controllers/pokemon_controller.rb

  def destroy
    @pokemon = Pokemon.find(params[:id])
    @pokemon.destroy
---
SELECT  "pokemons".* FROM "pokemons"  WHERE "pokemons"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "pokemons" WHERE "pokemons"."id" = $1  [["id", 2]]

  def update
    @pokemon = Pokemon.find(params[:id])

    if @pokemon.update(pokemon_params)
---
SELECT  "pokemons".* FROM "pokemons"  WHERE "pokemons"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "pokemons" SET "defense" = $1, "moves" = $2, "updated_at" = $3 WHERE "pokemons"."id" = 1  [["defense", 12], ["moves", "---\n- horn attack\n- stomp\n- earthquake\n- megahorn\n"], ["updated_at", "2015-06-02 00:54:29.264796"]]